/******************************************************************************\
**  版    权 :  深圳开鸿数字产业发展有限公司（2021）
**  文件名称 :  Mix2111d.h
**  功能描述 :  Mix2111d酒精浓度模组驱动
**  作    者 :  王滨泉
**  日    期 :  2021.11.01
**  版    本 :  V0.0.1
**  变更记录 :  V0.0.1/2021.11.01
                1 首次创建                 
\******************************************************************************/
#ifndef _MIX2111D_H_
#define _MIX2111D_H_
/******************************************************************************\
                             Includes
\******************************************************************************/
#include <stdio.h>
#include <unistd.h>
#include <securec.h>

#include "ohos_init.h"
#include "cmsis_os2.h"
#include "ohos_types.h"
#include "iot_errno.h"
#include "iot_gpio.h"
#include <hi_io.h>
#include <hi_uart.h>
/******************************************************************************\
                          Macro definitions
\******************************************************************************/

/******************************************************************************\
                         Typedef definitions
\******************************************************************************/

/******************************************************************************\
                    Global variables and functions
\******************************************************************************/
/*
* 函数名称 : Get_MIX2111D_Alcoho
* 功能描述 : 获取酒精浓度
* 参    数 : 无
* 返回值   : 酒精浓度
* 示    例 : Alcohol = Get_MIX2111D_Alcoho();
*/
/******************************************************************************/ 
extern uint16_t Get_MIX2111D_Alcoho(void);
/******************************************************************************/

/*
* 函数名称 : Get_MIX2111D_Alcoho_Alarm_Threshold
* 功能描述 : 获取酒精浓度阈值
* 参    数 : 无
* 返回值   : 酒精浓度
* 示    例 : Alcohol = Get_MIX2111D_Alcoho_Alarm_Threshold();
*/
/******************************************************************************/ 
extern uint16_t Get_MIX2111D_Alcoho_Alarm_Threshold(void);
/******************************************************************************/

/*
* 函数名称 : Set_MIX2111D_Alcoho_Alarm_Threshold
* 功能描述 : 设置酒精浓度阈值
* 参    数 : 无
* 返回值   : 酒精浓度
* 示    例 : Set_MIX2111D_Alcoho_Alarm_Threshold(Alcohol_Threshold);
*/
/******************************************************************************/ 
extern void Set_MIX2111D_Alcoho_Alarm_Threshold(uint16_t Alcohol_Threshold);
/******************************************************************************/
#endif
