/******************************************************************************\
**  版    权 :  深圳开鸿数字产业发展有限公司（2021）
**  文件名称 :  ly_evk_config.h
**  功能描述 :  开发板功能配置文件
**  作    者 :  王滨泉
**  日    期 :  2021.09.27
**  版    本 :  V0.0.1
**  变更记录 :  V0.0.1/2021.09.27
                1 首次创建                 
\******************************************************************************/

#ifndef _LY_EVK_CONFIG_H_
#define _LY_EVK_CONFIG_H_
/******************************************************************************\
                             Includes
\******************************************************************************/	

/******************************************************************************\
                          Macro definitions
\******************************************************************************/
#define MODULE_FIRE                 0
#define MODULE_SOIL                 0
#define MODULE_TEMP_HUMI            0
#define MODULE_ALCOHOL              0
#define MODULE_COLOUR               0
#define MODULE_HR_SPO2              0
#define MODULE_AIR                  0
#define MODULE_MEASUREMENT_TEMP     0
#define MODULE_ORIENTATION          0
#define MODUIL_TRAFFIC_LIGHT        0
#define MODUIL_PIR                  0
#define MODUIL_GAS                  0
#define MODULE_QR                   1
/******************************************************************************\
                         Typedef definitions
\******************************************************************************/

#endif
/******************************* End of File (H) ******************************/